k6/run-mvc-10l-1000vu-10pool.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6-simple.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 2m25s max duration (incl. graceful stop):
              * ramp: Up to 1000 looping VUs for 2m15s over 4 stages (gracefulRampDown: 10s, gracefulStop: 30s)


running (0m01.0s), 0001/1000 VUs, 0 complete and 0 interrupted iterations
ramp   [   1% ] 0001/1000 VUs  0m01.0s/2m15.0s

running (0m02.0s), 0002/1000 VUs, 3514 complete and 0 interrupted iterations
ramp   [   1% ] 0002/1000 VUs  0m02.0s/2m15.0s

running (0m03.0s), 0003/1000 VUs, 13985 complete and 0 interrupted iterations
ramp   [   2% ] 0003/1000 VUs  0m03.0s/2m15.0s

running (0m04.0s), 0005/1000 VUs, 29680 complete and 0 interrupted iterations
ramp   [   3% ] 0005/1000 VUs  0m04.0s/2m15.0s

running (0m05.0s), 0006/1000 VUs, 49643 complete and 0 interrupted iterations
ramp   [   4% ] 0006/1000 VUs  0m05.0s/2m15.0s

running (0m06.0s), 0007/1000 VUs, 72973 complete and 0 interrupted iterations
ramp   [   4% ] 0007/1000 VUs  0m06.0s/2m15.0s

running (0m07.0s), 0009/1000 VUs, 100624 complete and 0 interrupted iterations
ramp   [   5% ] 0009/1000 VUs  0m07.0s/2m15.0s

running (0m08.0s), 0010/1000 VUs, 131006 complete and 0 interrupted iterations
ramp   [   6% ] 0010/1000 VUs  0m08.0s/2m15.0s

running (0m09.0s), 0011/1000 VUs, 163200 complete and 0 interrupted iterations
ramp   [   7% ] 0011/1000 VUs  0m09.0s/2m15.0s

running (0m10.0s), 0013/1000 VUs, 197609 complete and 0 interrupted iterations
ramp   [   7% ] 0013/1000 VUs  0m10.0s/2m15.0s

running (0m11.0s), 0014/1000 VUs, 233255 complete and 0 interrupted iterations
ramp   [   8% ] 0014/1000 VUs  0m11.0s/2m15.0s

running (0m12.0s), 0015/1000 VUs, 271069 complete and 0 interrupted iterations
ramp   [   9% ] 0015/1000 VUs  0m12.0s/2m15.0s

running (0m13.0s), 0017/1000 VUs, 310078 complete and 0 interrupted iterations
ramp   [  10% ] 0017/1000 VUs  0m13.0s/2m15.0s

running (0m14.0s), 0018/1000 VUs, 349157 complete and 0 interrupted iterations
ramp   [  10% ] 0018/1000 VUs  0m14.0s/2m15.0s

running (0m15.0s), 0019/1000 VUs, 388765 complete and 0 interrupted iterations
ramp   [  11% ] 0019/1000 VUs  0m15.0s/2m15.0s

running (0m16.0s), 0040/1000 VUs, 428385 complete and 0 interrupted iterations
ramp   [  12% ] 0040/1000 VUs  0m16.0s/2m15.0s

running (0m17.0s), 0062/1000 VUs, 468977 complete and 0 interrupted iterations
ramp   [  13% ] 0062/1000 VUs  0m17.0s/2m15.0s

running (0m18.0s), 0084/1000 VUs, 509159 complete and 0 interrupted iterations
ramp   [  13% ] 0084/1000 VUs  0m18.0s/2m15.0s

running (0m19.0s), 0106/1000 VUs, 550825 complete and 0 interrupted iterations
ramp   [  14% ] 0106/1000 VUs  0m19.0s/2m15.0s

running (0m20.0s), 0127/1000 VUs, 591559 complete and 0 interrupted iterations
ramp   [  15% ] 0127/1000 VUs  0m20.0s/2m15.0s

running (0m21.0s), 0149/1000 VUs, 631346 complete and 0 interrupted iterations
ramp   [  16% ] 0149/1000 VUs  0m21.0s/2m15.0s

running (0m22.0s), 0171/1000 VUs, 671126 complete and 0 interrupted iterations
ramp   [  16% ] 0171/1000 VUs  0m22.0s/2m15.0s

running (0m23.0s), 0193/1000 VUs, 710928 complete and 0 interrupted iterations
ramp   [  17% ] 0193/1000 VUs  0m23.0s/2m15.0s

running (0m24.0s), 0214/1000 VUs, 751269 complete and 0 interrupted iterations
ramp   [  18% ] 0214/1000 VUs  0m24.0s/2m15.0s

running (0m25.0s), 0236/1000 VUs, 791899 complete and 0 interrupted iterations
ramp   [  18% ] 0236/1000 VUs  0m25.0s/2m15.0s

running (0m26.0s), 0258/1000 VUs, 832154 complete and 0 interrupted iterations
ramp   [  19% ] 0258/1000 VUs  0m26.0s/2m15.0s

running (0m27.0s), 0280/1000 VUs, 872463 complete and 0 interrupted iterations
ramp   [  20% ] 0280/1000 VUs  0m27.0s/2m15.0s

running (0m28.0s), 0302/1000 VUs, 912439 complete and 0 interrupted iterations
ramp   [  21% ] 0302/1000 VUs  0m28.0s/2m15.0s

running (0m29.0s), 0323/1000 VUs, 951947 complete and 0 interrupted iterations
ramp   [  21% ] 0323/1000 VUs  0m29.0s/2m15.0s

running (0m30.0s), 0345/1000 VUs, 992093 complete and 0 interrupted iterations
ramp   [  22% ] 0345/1000 VUs  0m30.0s/2m15.0s

running (0m31.0s), 0367/1000 VUs, 1029921 complete and 0 interrupted iterations
ramp   [  23% ] 0367/1000 VUs  0m31.0s/2m15.0s

running (0m32.0s), 0389/1000 VUs, 1069893 complete and 0 interrupted iterations
ramp   [  24% ] 0389/1000 VUs  0m32.0s/2m15.0s

running (0m33.0s), 0410/1000 VUs, 1110205 complete and 0 interrupted iterations
ramp   [  24% ] 0410/1000 VUs  0m33.0s/2m15.0s

running (0m34.0s), 0432/1000 VUs, 1150625 complete and 0 interrupted iterations
ramp   [  25% ] 0432/1000 VUs  0m34.0s/2m15.0s

running (0m35.0s), 0454/1000 VUs, 1189854 complete and 0 interrupted iterations
ramp   [  26% ] 0454/1000 VUs  0m35.0s/2m15.0s

running (0m36.0s), 0476/1000 VUs, 1227691 complete and 0 interrupted iterations
ramp   [  27% ] 0476/1000 VUs  0m36.0s/2m15.0s

running (0m37.0s), 0498/1000 VUs, 1267031 complete and 0 interrupted iterations
ramp   [  27% ] 0498/1000 VUs  0m37.0s/2m15.0s

running (0m38.0s), 0519/1000 VUs, 1306058 complete and 0 interrupted iterations
ramp   [  28% ] 0519/1000 VUs  0m38.0s/2m15.0s

running (0m39.0s), 0541/1000 VUs, 1344627 complete and 0 interrupted iterations
ramp   [  29% ] 0541/1000 VUs  0m39.0s/2m15.0s

running (0m40.0s), 0563/1000 VUs, 1383998 complete and 0 interrupted iterations
ramp   [  30% ] 0563/1000 VUs  0m40.0s/2m15.0s

running (0m41.0s), 0585/1000 VUs, 1421651 complete and 0 interrupted iterations
ramp   [  30% ] 0585/1000 VUs  0m41.0s/2m15.0s

running (0m42.0s), 0606/1000 VUs, 1460920 complete and 0 interrupted iterations
ramp   [  31% ] 0606/1000 VUs  0m42.0s/2m15.0s

running (0m43.0s), 0628/1000 VUs, 1500350 complete and 0 interrupted iterations
ramp   [  32% ] 0628/1000 VUs  0m43.0s/2m15.0s

running (0m44.0s), 0650/1000 VUs, 1541081 complete and 0 interrupted iterations
ramp   [  33% ] 0650/1000 VUs  0m44.0s/2m15.0s

running (0m45.0s), 0672/1000 VUs, 1579497 complete and 0 interrupted iterations
ramp   [  33% ] 0672/1000 VUs  0m45.0s/2m15.0s

running (0m46.0s), 0694/1000 VUs, 1617227 complete and 0 interrupted iterations
ramp   [  34% ] 0694/1000 VUs  0m46.0s/2m15.0s

running (0m47.0s), 0715/1000 VUs, 1655659 complete and 0 interrupted iterations
ramp   [  35% ] 0715/1000 VUs  0m47.0s/2m15.0s

running (0m48.0s), 0737/1000 VUs, 1694735 complete and 0 interrupted iterations
ramp   [  36% ] 0737/1000 VUs  0m48.0s/2m15.0s

running (0m49.0s), 0759/1000 VUs, 1733919 complete and 0 interrupted iterations
ramp   [  36% ] 0759/1000 VUs  0m49.0s/2m15.0s

running (0m50.0s), 0781/1000 VUs, 1773244 complete and 0 interrupted iterations
ramp   [  37% ] 0781/1000 VUs  0m50.0s/2m15.0s

running (0m51.0s), 0802/1000 VUs, 1811693 complete and 0 interrupted iterations
ramp   [  38% ] 0802/1000 VUs  0m51.0s/2m15.0s

running (0m52.0s), 0824/1000 VUs, 1851263 complete and 0 interrupted iterations
ramp   [  38% ] 0824/1000 VUs  0m52.0s/2m15.0s

running (0m53.0s), 0846/1000 VUs, 1890401 complete and 0 interrupted iterations
ramp   [  39% ] 0846/1000 VUs  0m53.0s/2m15.0s

running (0m54.0s), 0868/1000 VUs, 1929619 complete and 0 interrupted iterations
ramp   [  40% ] 0868/1000 VUs  0m54.0s/2m15.0s

running (0m55.0s), 0890/1000 VUs, 1969742 complete and 0 interrupted iterations
ramp   [  41% ] 0890/1000 VUs  0m55.0s/2m15.0s

running (0m56.0s), 0911/1000 VUs, 2008274 complete and 0 interrupted iterations
ramp   [  41% ] 0911/1000 VUs  0m56.0s/2m15.0s

running (0m57.0s), 0933/1000 VUs, 2046180 complete and 0 interrupted iterations
ramp   [  42% ] 0933/1000 VUs  0m57.0s/2m15.0s

running (0m58.0s), 0955/1000 VUs, 2086369 complete and 0 interrupted iterations
ramp   [  43% ] 0955/1000 VUs  0m58.0s/2m15.0s

running (0m59.0s), 0977/1000 VUs, 2125607 complete and 0 interrupted iterations
ramp   [  44% ] 0977/1000 VUs  0m59.0s/2m15.0s

running (1m00.0s), 0998/1000 VUs, 2165332 complete and 0 interrupted iterations
ramp   [  44% ] 0998/1000 VUs  1m00.0s/2m15.0s

running (1m01.0s), 1000/1000 VUs, 2203246 complete and 0 interrupted iterations
ramp   [  45% ] 1000/1000 VUs  1m01.0s/2m15.0s

running (1m02.0s), 1000/1000 VUs, 2242883 complete and 0 interrupted iterations
ramp   [  46% ] 1000/1000 VUs  1m02.0s/2m15.0s

running (1m03.0s), 1000/1000 VUs, 2282311 complete and 0 interrupted iterations
ramp   [  47% ] 1000/1000 VUs  1m03.0s/2m15.0s

running (1m04.0s), 1000/1000 VUs, 2321674 complete and 0 interrupted iterations
ramp   [  47% ] 1000/1000 VUs  1m04.0s/2m15.0s

running (1m05.0s), 1000/1000 VUs, 2360973 complete and 0 interrupted iterations
ramp   [  48% ] 1000/1000 VUs  1m05.0s/2m15.0s

running (1m06.0s), 1000/1000 VUs, 2398577 complete and 0 interrupted iterations
ramp   [  49% ] 1000/1000 VUs  1m06.0s/2m15.0s

running (1m07.0s), 1000/1000 VUs, 2437715 complete and 0 interrupted iterations
ramp   [  50% ] 1000/1000 VUs  1m07.0s/2m15.0s

running (1m08.0s), 1000/1000 VUs, 2477405 complete and 0 interrupted iterations
ramp   [  50% ] 1000/1000 VUs  1m08.0s/2m15.0s

running (1m09.0s), 1000/1000 VUs, 2516124 complete and 0 interrupted iterations
ramp   [  51% ] 1000/1000 VUs  1m09.0s/2m15.0s

running (1m10.0s), 1000/1000 VUs, 2555187 complete and 0 interrupted iterations
ramp   [  52% ] 1000/1000 VUs  1m10.0s/2m15.0s

running (1m11.0s), 1000/1000 VUs, 2592803 complete and 0 interrupted iterations
ramp   [  53% ] 1000/1000 VUs  1m11.0s/2m15.0s

running (1m12.0s), 1000/1000 VUs, 2632057 complete and 0 interrupted iterations
ramp   [  53% ] 1000/1000 VUs  1m12.0s/2m15.0s

running (1m13.0s), 1000/1000 VUs, 2670931 complete and 0 interrupted iterations
ramp   [  54% ] 1000/1000 VUs  1m13.0s/2m15.0s

running (1m14.0s), 1000/1000 VUs, 2710778 complete and 0 interrupted iterations
ramp   [  55% ] 1000/1000 VUs  1m14.0s/2m15.0s

running (1m15.0s), 1000/1000 VUs, 2749432 complete and 0 interrupted iterations
ramp   [  56% ] 1000/1000 VUs  1m15.0s/2m15.0s

running (1m16.0s), 1000/1000 VUs, 2788146 complete and 0 interrupted iterations
ramp   [  56% ] 1000/1000 VUs  1m16.0s/2m15.0s

running (1m17.0s), 1000/1000 VUs, 2827269 complete and 0 interrupted iterations
ramp   [  57% ] 1000/1000 VUs  1m17.0s/2m15.0s

running (1m18.0s), 1000/1000 VUs, 2866908 complete and 0 interrupted iterations
ramp   [  58% ] 1000/1000 VUs  1m18.0s/2m15.0s

running (1m19.0s), 1000/1000 VUs, 2904903 complete and 0 interrupted iterations
ramp   [  58% ] 1000/1000 VUs  1m19.0s/2m15.0s

running (1m20.0s), 1000/1000 VUs, 2943575 complete and 0 interrupted iterations
ramp   [  59% ] 1000/1000 VUs  1m20.0s/2m15.0s

running (1m21.0s), 1000/1000 VUs, 2982395 complete and 0 interrupted iterations
ramp   [  60% ] 1000/1000 VUs  1m21.0s/2m15.0s

running (1m22.0s), 1000/1000 VUs, 3022934 complete and 0 interrupted iterations
ramp   [  61% ] 1000/1000 VUs  1m22.0s/2m15.0s

running (1m23.0s), 1000/1000 VUs, 3062349 complete and 0 interrupted iterations
ramp   [  61% ] 1000/1000 VUs  1m23.0s/2m15.0s

running (1m24.0s), 1000/1000 VUs, 3101999 complete and 0 interrupted iterations
ramp   [  62% ] 1000/1000 VUs  1m24.0s/2m15.0s

running (1m25.0s), 1000/1000 VUs, 3141109 complete and 0 interrupted iterations
ramp   [  63% ] 1000/1000 VUs  1m25.0s/2m15.0s

running (1m26.0s), 1000/1000 VUs, 3179312 complete and 0 interrupted iterations
ramp   [  64% ] 1000/1000 VUs  1m26.0s/2m15.0s

running (1m27.0s), 1000/1000 VUs, 3217431 complete and 0 interrupted iterations
ramp   [  64% ] 1000/1000 VUs  1m27.0s/2m15.0s

running (1m28.0s), 1000/1000 VUs, 3256615 complete and 0 interrupted iterations
ramp   [  65% ] 1000/1000 VUs  1m28.0s/2m15.0s

running (1m29.0s), 1000/1000 VUs, 3294637 complete and 0 interrupted iterations
ramp   [  66% ] 1000/1000 VUs  1m29.0s/2m15.0s

running (1m30.0s), 1000/1000 VUs, 3333421 complete and 0 interrupted iterations
ramp   [  67% ] 1000/1000 VUs  1m30.0s/2m15.0s

running (1m31.0s), 1000/1000 VUs, 3371152 complete and 0 interrupted iterations
ramp   [  67% ] 1000/1000 VUs  1m31.0s/2m15.0s

running (1m32.0s), 1000/1000 VUs, 3409177 complete and 0 interrupted iterations
ramp   [  68% ] 1000/1000 VUs  1m32.0s/2m15.0s

running (1m33.0s), 1000/1000 VUs, 3447555 complete and 0 interrupted iterations
ramp   [  69% ] 1000/1000 VUs  1m33.0s/2m15.0s

running (1m34.0s), 1000/1000 VUs, 3487114 complete and 0 interrupted iterations
ramp   [  70% ] 1000/1000 VUs  1m34.0s/2m15.0s

running (1m35.0s), 1000/1000 VUs, 3526223 complete and 0 interrupted iterations
ramp   [  70% ] 1000/1000 VUs  1m35.0s/2m15.0s

running (1m36.0s), 1000/1000 VUs, 3564602 complete and 0 interrupted iterations
ramp   [  71% ] 1000/1000 VUs  1m36.0s/2m15.0s

running (1m37.0s), 1000/1000 VUs, 3600776 complete and 0 interrupted iterations
ramp   [  72% ] 1000/1000 VUs  1m37.0s/2m15.0s

running (1m38.0s), 1000/1000 VUs, 3639445 complete and 0 interrupted iterations
ramp   [  73% ] 1000/1000 VUs  1m38.0s/2m15.0s

running (1m39.0s), 1000/1000 VUs, 3678142 complete and 0 interrupted iterations
ramp   [  73% ] 1000/1000 VUs  1m39.0s/2m15.0s

running (1m40.0s), 1000/1000 VUs, 3714763 complete and 0 interrupted iterations
ramp   [  74% ] 1000/1000 VUs  1m40.0s/2m15.0s

running (1m41.0s), 1000/1000 VUs, 3749470 complete and 0 interrupted iterations
ramp   [  75% ] 1000/1000 VUs  1m41.0s/2m15.0s

running (1m42.0s), 1000/1000 VUs, 3787562 complete and 0 interrupted iterations
ramp   [  76% ] 1000/1000 VUs  1m42.0s/2m15.0s

running (1m43.0s), 1000/1000 VUs, 3826429 complete and 0 interrupted iterations
ramp   [  76% ] 1000/1000 VUs  1m43.0s/2m15.0s

running (1m44.0s), 1000/1000 VUs, 3862850 complete and 0 interrupted iterations
ramp   [  77% ] 1000/1000 VUs  1m44.0s/2m15.0s

running (1m45.0s), 1000/1000 VUs, 3901072 complete and 0 interrupted iterations
ramp   [  78% ] 1000/1000 VUs  1m45.0s/2m15.0s

running (1m46.0s), 1000/1000 VUs, 3939398 complete and 0 interrupted iterations
ramp   [  78% ] 1000/1000 VUs  1m46.0s/2m15.0s

running (1m47.0s), 1000/1000 VUs, 3977893 complete and 0 interrupted iterations
ramp   [  79% ] 1000/1000 VUs  1m47.0s/2m15.0s

running (1m48.0s), 1000/1000 VUs, 4017695 complete and 0 interrupted iterations
ramp   [  80% ] 1000/1000 VUs  1m48.0s/2m15.0s

running (1m49.0s), 1000/1000 VUs, 4057225 complete and 0 interrupted iterations
ramp   [  81% ] 1000/1000 VUs  1m49.0s/2m15.0s

running (1m50.0s), 1000/1000 VUs, 4096749 complete and 0 interrupted iterations
ramp   [  81% ] 1000/1000 VUs  1m50.0s/2m15.0s

running (1m51.0s), 1000/1000 VUs, 4133776 complete and 0 interrupted iterations
ramp   [  82% ] 1000/1000 VUs  1m51.0s/2m15.0s

running (1m52.0s), 1000/1000 VUs, 4172655 complete and 0 interrupted iterations
ramp   [  83% ] 1000/1000 VUs  1m52.0s/2m15.0s

running (1m53.0s), 1000/1000 VUs, 4211336 complete and 0 interrupted iterations
ramp   [  84% ] 1000/1000 VUs  1m53.0s/2m15.0s

running (1m54.0s), 1000/1000 VUs, 4251034 complete and 0 interrupted iterations
ramp   [  84% ] 1000/1000 VUs  1m54.0s/2m15.0s

running (1m55.0s), 1000/1000 VUs, 4289788 complete and 0 interrupted iterations
ramp   [  85% ] 1000/1000 VUs  1m55.0s/2m15.0s

running (1m56.0s), 1000/1000 VUs, 4327470 complete and 0 interrupted iterations
ramp   [  86% ] 1000/1000 VUs  1m56.0s/2m15.0s

running (1m57.0s), 1000/1000 VUs, 4363434 complete and 0 interrupted iterations
ramp   [  87% ] 1000/1000 VUs  1m57.0s/2m15.0s

running (1m58.0s), 1000/1000 VUs, 4402653 complete and 0 interrupted iterations
ramp   [  87% ] 1000/1000 VUs  1m58.0s/2m15.0s

running (1m59.0s), 1000/1000 VUs, 4440579 complete and 0 interrupted iterations
ramp   [  88% ] 1000/1000 VUs  1m59.0s/2m15.0s

running (2m00.0s), 1000/1000 VUs, 4478307 complete and 0 interrupted iterations
ramp   [  89% ] 1000/1000 VUs  2m00.0s/2m15.0s

running (2m01.0s), 0940/1000 VUs, 4515545 complete and 0 interrupted iterations
ramp   [  90% ] 0940/1000 VUs  2m01.0s/2m15.0s

running (2m02.0s), 0871/1000 VUs, 4553470 complete and 0 interrupted iterations
ramp   [  90% ] 0871/1000 VUs  2m02.0s/2m15.0s

running (2m03.0s), 0805/1000 VUs, 4591484 complete and 0 interrupted iterations
ramp   [  91% ] 0805/1000 VUs  2m03.0s/2m15.0s

running (2m04.0s), 0737/1000 VUs, 4628634 complete and 0 interrupted iterations
ramp   [  92% ] 0737/1000 VUs  2m04.0s/2m15.0s

running (2m05.0s), 0671/1000 VUs, 4666306 complete and 0 interrupted iterations
ramp   [  93% ] 0671/1000 VUs  2m05.0s/2m15.0s

running (2m06.0s), 0605/1000 VUs, 4701534 complete and 0 interrupted iterations
ramp   [  93% ] 0605/1000 VUs  2m06.0s/2m15.0s

running (2m07.0s), 0538/1000 VUs, 4739486 complete and 0 interrupted iterations
ramp   [  94% ] 0538/1000 VUs  2m07.0s/2m15.0s

running (2m08.0s), 0472/1000 VUs, 4775580 complete and 0 interrupted iterations
ramp   [  95% ] 0472/1000 VUs  2m08.0s/2m15.0s

running (2m09.0s), 0404/1000 VUs, 4812348 complete and 0 interrupted iterations
ramp   [  96% ] 0404/1000 VUs  2m09.0s/2m15.0s

running (2m10.0s), 0337/1000 VUs, 4850586 complete and 0 interrupted iterations
ramp   [  96% ] 0337/1000 VUs  2m10.0s/2m15.0s

running (2m11.0s), 0271/1000 VUs, 4886942 complete and 0 interrupted iterations
ramp   [  97% ] 0271/1000 VUs  2m11.0s/2m15.0s

running (2m12.0s), 0205/1000 VUs, 4924259 complete and 0 interrupted iterations
ramp   [  98% ] 0205/1000 VUs  2m12.0s/2m15.0s

running (2m13.0s), 0137/1000 VUs, 4961914 complete and 0 interrupted iterations
ramp   [  98% ] 0137/1000 VUs  2m13.0s/2m15.0s

running (2m14.0s), 0071/1000 VUs, 4999071 complete and 0 interrupted iterations
ramp   [  99% ] 0071/1000 VUs  2m14.0s/2m15.0s

running (2m15.0s), 0004/1000 VUs, 5034052 complete and 0 interrupted iterations
ramp   [ 100% ] 0004/1000 VUs  2m15.0s/2m15.0s

running (2m15.0s), 0000/1000 VUs, 5034501 complete and 0 interrupted iterations
ramp ✓ [ 100% ] 0000/1000 VUs  2m15s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=40.21ms

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 5034501 37292.341164/s
    checks_succeeded...: 100.00% 5034501 out of 5034501
    checks_failed......: 0.00%   0 out of 5034501

    ✓ 200

    HTTP
    http_req_duration..............: avg=17.92ms min=169µs    med=19.51ms max=248.07ms p(90)=32.45ms p(95)=40.21ms
      { expected_response:true }...: avg=17.92ms min=169µs    med=19.51ms max=248.07ms p(90)=32.45ms p(95)=40.21ms
    http_req_failed................: 0.00%   0 out of 5034501
    http_reqs......................: 5034501 37292.341164/s

    EXECUTION
    iteration_duration.............: avg=17.98ms min=188.12µs med=19.55ms max=248.1ms  p(90)=32.57ms p(95)=40.33ms
    iterations.....................: 5034501 37292.341164/s
    vus............................: 4       min=1            max=1000
    vus_max........................: 1000    min=1000         max=1000

    NETWORK
    data_received..................: 10 GB   76 MB/s
    data_sent......................: 564 MB  4.2 MB/s



running (2m15.0s), 0000/1000 VUs, 5034501 complete and 0 interrupted iterations
ramp ✓ [ 100% ] 0000/1000 VUs  2m15s